{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Hey",
        "Good morning",
        "Good evening",
        "Is anyone there?"
      ],
      "responses": [
        "Hello! Welcome to Gujarat Vidyapith admission helpdesk.",
        "Hi there, how can I assist you with the admission process?",
        "Namaste! How may I help you today?"
      ]
    },
    {
      "tag": "admission_process",
      "patterns": [
        "How can I apply for admission?",
        "What is the admission process?",
        "How do I get admission in Gujarat Vidyapith?",
        "Tell me about the admission procedure"
      ],
      "responses": [
        "You can apply for admission through the official Gujarat Vidyapith website under the 'Admissions' section.",
        "The admission process usually involves filling out the online form, submitting required documents, and appearing for the entrance exam or interview if applicable."
      ]
    },
    {
      "tag": "courses",
      "patterns": [
        "Which courses are available?",
        "What programs do you offer?",
        "List of courses",
        "Tell me about the courses in Gujarat Vidyapith"
      ],
      "responses": [
        "We offer undergraduate, postgraduate, diploma, and PhD programs in various disciplines including Arts, Science, Education, Social Work, Rural Studies, and Management.",
        "Programs include BA, B.Sc, B.Ed, MA, M.Sc, M.Ed, MBA, MSW, M.Phil, and Ph.D."
      ]
    },
    {
      "tag": "eligibility",
      "patterns": [
        "What is the eligibility for admission?",
        "Who can apply?",
        "Admission requirements",
        "Minimum qualification needed"
      ],
      "responses": [
        "Eligibility depends on the program. For UG courses, you need to have passed Class 12. For PG courses, you must hold a relevant bachelor’s degree. For Ph.D., a postgraduate degree is required.",
        "Specific eligibility criteria are mentioned in the admission notification on the Gujarat Vidyapith website."
      ]
    },
    {
      "tag": "entrance_exam",
      "patterns": [
        "Is there an entrance exam?",
        "Do I have to take a test?",
        "Admission test details",
        "Is interview required?"
      ],
      "responses": [
        "Some programs require an entrance exam and/or interview. The details are published along with the admission announcement.",
        "Yes, depending on the course, you may need to appear for a test or interview."
      ]
    },
    {
      "tag": "fees",
      "patterns": [
        "What is the fee structure?",
        "How much is the admission fee?",
        "Tell me about tuition fees",
        "Cost of studying"
      ],
      "responses": [
        "The fee structure varies by program. You can check the detailed fee structure on the official Gujarat Vidyapith admission page.",
        "Fees are kept affordable since Gujarat Vidyapith is a deemed university established by Mahatma Gandhi, but exact details depend on the course."
      ]
    },
    {
      "tag": "scholarship",
      "patterns": [
        "Are there any scholarships?",
        "Do you provide financial aid?",
        "Scholarship options",
        "Can I get a fee waiver?"
      ],
      "responses": [
        "Yes, Gujarat Vidyapith provides scholarships and financial assistance to eligible students as per government and university rules.",
        "Scholarships are available for SC/ST/OBC, minority students, and economically weaker sections."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I contact the admission office?",
        "What is the helpline number?",
        "Email for admission enquiry",
        "Where is Gujarat Vidyapith located?"
      ],
      "responses": [
        "You can contact the Admission Office at Gujarat Vidyapith, Ashram Road, Ahmedabad. Visit the official website for phone numbers and email addresses.",
        "For admission-related queries, write to admissions@gujaratvidyapith.org or call the university helpline."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "Goodbye", "See you", "Talk to you later"],
      "responses": [
        "Goodbye! Wishing you the best for your admission journey.",
        "Take care! Feel free to come back if you have more admission questions."
      ]
    }
  ]
}