{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "hi",
                "hello",
                "hey",
                "hey there",
                "good morning",
                "good afternoon",
                "good evening",
                "namaste",
                "hi bot",
                "hello chatbot",
                "is anyone there",
                "yo",
                "hi",
                "hello",
                "hey",
                "hey there",
                "good morning",
                "good afternoon",
                "good evening",
                "namaste",
                "hi bot",
                "hello chatbot",
                "is anyone there",
                "yo"
            ],
            "responses": [
                "Hello! How can I help you with Gujarat Vidyapith information?",
                "Hi, tell me what you want to know about Gujarat Vidyapith.",
                "Namaste! You can ask me about admissions, courses, departments or campus facilities.",
                "Hello! How can I help you with Gujarat Vidyapith information?",
                "Hi, tell me what you want to know about Gujarat Vidyapith.",
                "Namaste! You can ask me about admissions, courses, departments or campus facilities."
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "bye",
                "ok bye",
                "goodbye",
                "see you",
                "talk to you later",
                "thank you bye",
                "okay thanks bye"
            ],
            "responses": [
                "Thank you for chatting. All the best!",
                "Goodbye! Feel free to come back if you have more questions.",
                "See you! I’m here whenever you need Gujarat Vidyapith info."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "thanks",
                "thank you",
                "thank you so much",
                "thanks a lot",
                "ok thanks",
                "great thanks",
                "nice thanks"
            ],
            "responses": [
                "You’re welcome! Do you want to know anything else?",
                "Glad I could help. Anything more about Gujarat Vidyapith?",
                "Any time! You can ask more questions if you like."
            ]
        },
        {
            "tag": "general_info",
            "patterns": [
                "tell me about gujarat vidyapith",
                "what is gujarat vidyapith",
                "about gujarat vidyapith",
                "gujarat vidyapith details",
                "when was gujarat vidyapith founded",
                "who founded gujarat vidyapith",
                "gvp university information",
                "gujarat vidyapith profile"
            ],
            "responses": [
                "Gujarat Vidyapith is a deemed university founded by Mahatma Gandhi on 18 October 1920. It follows Gandhian values and offers programs from UG to PhD in humanities, social sciences, education, science and rural management. For official details, visit the university website: https://gujaratvidyapith.org",
                "Gujarat Vidyapith, started by Mahatma Gandhi in 1920, is a Gandhian university with many UG, PG and PhD programs. You can see the full profile on the official site."
            ]
        },
        {
            "tag": "admission_info",
            "patterns": [
                "how can i apply for admission",
                "what is the admission process",
                "how to get admission",
                "admission procedure",
                "ug admission process",
                "pg admission process",
                "admission 2025 details",
                "how to apply online",
                "gvp admission info"
            ],
            "responses": [
                "Admissions are done through the official admission portal and prospectus. Common steps: check eligibility in the prospectus, fill the online form, appear for entrance/merit process if required, then complete document verification and fee payment. For latest rules and dates, see the admission page: https://gujaratvidyapith.org/admission/",
                "To get admission, first check the latest admission brochure, then apply online as per the schedule, and follow the entrance/merit and document verification process mentioned there."
            ]
        },
        {
            "tag": "fees_overview",
            "patterns": [
                "what are the fees",
                "fee structure",
                "course fees",
                "fees for ug courses",
                "fees for pg courses",
                "how much does bca cost",
                "how much is msc fee",
                "gvp fees details"
            ],
            "responses": [
                "Fees depend on the program and year. Arts and social science courses are usually lower cost, while professional and vocational courses may be higher. For exact fee structure, always refer to the latest admission prospectus or fee circular on the admission page: https://gujaratvidyapith.org/admission/",
                "The exact fee for each course is given in the current admission brochure. Please check the official admission PDF for updated fees."
            ]
        },
        {
            "tag": "documents_required",
            "patterns": [
                "which documents are required for admission",
                "documents needed for admission",
                "list of documents for application",
                "what documents do i need for gujarat vidyapith admission",
                "documents for ug admission",
                "documents for pg admission"
            ],
            "responses": [
                "Common documents include: 10th and 12th mark sheets, graduation mark sheets (for PG), transfer/college leaving certificate, ID proof, passport-size photos, caste/ reservation certificate if applicable, and entrance score card if required. Always cross-check with the latest admission prospectus for your specific program.",
                "You will normally need your previous exam mark sheets, ID proof, photos, transfer certificate and category certificates (if applicable). Confirm the exact list in the official admission brochure."
            ]
        },
        {
            "tag": "contact",
            "patterns": [
                "how can i contact the university",
                "university phone number",
                "admission email",
                "gujarat vidyapith contact details",
                "gvp address",
                "university address and phone"
            ],
            "responses": [
                "Official contact numbers, email IDs and campus address are available on the contact page of Gujarat Vidyapith. Please refer to the latest details here: https://gujaratvidyapith.org/contact/",
                "For correct phone numbers and email addresses, check the Contact/Admission section on the official website. That page is kept updated."
            ]
        },
        {
            "tag": "campus_life",
            "patterns": [
                "tell me about campus life",
                "how is the campus life",
                "hostel facilities",
                "sports and activities",
                "what facilities are available on campus",
                "campus facilities gujarat vidyapith"
            ],
            "responses": [
                "The campus follows Gandhian values with community living, hostels, central library, sports facilities and various extension activities. Hostel and facility details, along with rules and fees, are usually given in the admission brochure and on the website.",
                "Gujarat Vidyapith offers hostels, library, sports and cultural activities in line with Gandhian philosophy. For detailed facilities and rules, check the university website or prospectus."
            ]
        },
        {
            "tag": "department_Computer_Science",
            "patterns": [
                "tell me about bca course",
                "bca in gujarat vidyapith",
                "computer science department details",
                "cs department gvp",
                "mca program at gujarat vidyapith",
                "computer science syllabus",
                "bca syllabus",
                "mca syllabus",
                "computer applications course"
            ],
            "responses": [
                "The Department of Computer Science offers BCA and related computer application programs. Syllabus and semester-wise course structure are available on the syllabus and department pages of the official website. For detailed eligibility, intake and fees, refer to the admission brochure.",
                "For BCA/MCA and other computer courses at Gujarat Vidyapith, please see the Computer Science department and syllabus pages on the official site: https://gujaratvidyapith.org/departments/"
            ]
        },
        {
            "tag": "library_info",
            "patterns": [
                "tell me about the library",
                "central library details",
                "library gujarat vidyapith",
                "library services",
                "library timing",
                "how is the library"
            ],
            "responses": [
                "Gujarat Vidyapith has a central library (Granthalay) that supports all major disciplines. For information about collection size, services and timings, please check the library section on the official website or contact the library directly: https://gujaratvidyapith.org/library/",
                "The central library provides books, journals and reference material for students and researchers. Exact rules and timings are given on the library page."
            ]
        },
        {
            "tag": "hostel_info",
            "patterns": [
                "is hostel available",
                "hostel information",
                "hostel fees",
                "how to get hostel",
                "girls hostel",
                "boys hostel"
            ],
            "responses": [
                "Yes, hostels are available for eligible students. Hostel allotment, rules and fees are given in the admission prospectus and hostel guidelines. Please see the latest admission brochure or contact the hostel office for accurate details.",
                "Hostel facilities exist for both boys and girls. For seat availability, rules and fee structure, always check the current prospectus or official notice."
            ]
        },
        {
            "tag": "not_found",
            "patterns": [
                "",
                "I don't understand",
                "you are wrong",
                "this is not correct",
                "you did not answer",
                "what are you saying"
            ],
            "responses": [
                "I’m not sure I understood that correctly. Can you please ask in a simpler way or specify the course/department/admission detail you want?",
                "I don’t have an exact answer for that. Try asking about a specific program, department, fees, admission process or contact detail.",
                "Sorry, I couldn’t find a clear answer. Please rephrase your question or ask about Gujarat Vidyapith courses, admissions, fees, hostels or campus."
            ]
        },
        {
            "tag": "Add New",
            "patterns": [
                "add pattern 1",
                "add pattern 2",
                "add pattern 3",
                "add pattern 4"
            ],
            "responses": [
                "add Responses 1",
                "add Responses 2",
                "add Responses 3"
            ]
        }
    ]
}